Tekla Open API Reference for Tekla Structures 2025
PickerInputPoint Constructor
 Creates a new PickerInputPoint instance with one point selected in a view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickerInputPoint(
	ViewBase pickedView,
	Point pickedPoint
)
Public Sub New (
	pickedView As ViewBase,
	pickedPoint As Point
)
Parameters
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
pickedPoint
Type: Tekla.Structures.Geometry3d.Point
The picked point in the view coordinates.
See Also
Reference
PickerInputPoint Class
Tekla.Structures.Drawing Namespace